{
  "version": "1.0",
  "type": "repository",
  "interval": "week",
  "date": "2025-12-14",
  "generatedAt": "2025-12-20T23:33:59.082Z",
  "sourceLastUpdated": "2025-12-20T23:33:59.082Z",
  "contentFormat": "markdown",
  "contentHash": "2a3caf0d8ab000b3c23dbfe09984288e572c5230205cd08a977cab81ae2b5b01",
  "entity": {
    "repoId": "ethereum-optimism/superchain-ops",
    "owner": "ethereum-optimism",
    "repo": "superchain-ops"
  },
  "content": "# ethereum-optimism/superchain-ops Weekly Report (Dec 14 - 20, 2025)\n\n## 🚀 Highlights\nThis week's efforts focused on hardening production systems, with key updates finalizing revenue sharing configurations for specific chains. Significant progress was made in resolving bugs related to the `op-node` sequencer and blob priority fee tracking, enhancing node stability. Meanwhile, important architectural discussions continued around simplifying the interop protocol, with a consensus forming to streamline the specification. New issues were identified in `op-challenger` and `op-deployer`, setting the stage for future refinement work.\n\n## 🛠️ Key Developments\nWork this week centered on preparing for production deployments and improving internal processes.\n\n- **Production Revenue Sharing Configuration:** Production configurations for revenue sharing tasks were finalized, replacing example values with their final settings. The updates streamline deployments by adjusting `upgradeAndSetup` and `setupRevShare` tasks for specific chains like OP, Ink, and Soneium ([#1318](https://github.com/ethereum-optimism/superchain-ops/pull/1318)).\n\n- **Repository & Test Maintenance:** Internal repository management was improved by updating the `CODEOWNERS` file for the `src/tasks/sep` directory to unblock other teams from merging changes ([#1322](https://github.com/ethereum-optimism/superchain-ops/pull/1322)). Additionally, test traceability was enhanced by adding an execution link to the Soneium testnet FP task status ([#1321](https://github.com/ethereum-optimism/superchain-ops/pull/1321)).\n\n## 🐛 Issues & Triage\n\n### Closed Issues\nSeveral key issues were resolved, improving node stability and testing infrastructure:\n- **Node Stability & Performance:** A bug in the `op-node` sequencer recovery mode that caused errors when fetching the next L1 origin was fixed through a code refactor ([#18350](https://github.com/ethereum-optimism/superchain-ops/issues/18350)). An issue regarding blob priority fee tracking was also closed, noting that the blob tip oracle is now deployed to production, though its data is currently informational ([#18102](https://github.com/ethereum-optimism/superchain-ops/issues/18102)).\n- **CI & Testing:** The previously disabled Kona interop action tests were re-enabled, restoring test coverage for the Kona chain ([#18613](https://github.com/ethereum-optimism/superchain-ops/issues/18613)).\n\n### New & Active Issues\nDiscussions on future architecture and newly discovered bugs defined the week's triage activity:\n- **Active Architectural Discussion:** A significant discussion continued on issue [#18574](https://github.com/ethereum-optimism/superchain-ops/issues/18574) regarding the interop protocol. A consensus is forming to simplify the protocol by removing an additional deposit transaction previously thought necessary for proofs, which would lead to a significant architectural refactoring.\n- **New Bugs Identified:** A new issue was opened to review the trace output in `op-challenger` when a super root is not found, which is critical for fault proof correctness ([#18643](https://github.com/ethereum-optimism/superchain-ops/issues/18643)). Another bug was reported in `op-deployer`, where an artifact extraction function fails due to a directory path mismatch, breaking self-hosted artifacts ([#18663](https://github.com/ethereum-optimism/superchain-ops/issues/18663)).\n\n## 💬 Community & Collaboration\nCollaboration was evident in both strategic discussions and practical repository maintenance. The active debate on the interop protocol ([#18574](https://github.com/ethereum-optimism/superchain-ops/issues/18574)) involved multiple team members (@Inphi, @ajsutton, @rdin777, @axelKingsley) working towards a consensus on a major architectural decision. Furthermore, the proactive update to the `CODEOWNERS` file ([#1322](https://github.com/ethereum-optimism/superchain-ops/pull/1322)) demonstrates a focus on improving cross-team velocity and reducing merge friction."
}