{
  "version": "1.0",
  "type": "repository",
  "interval": "day",
  "date": "2025-12-22",
  "generatedAt": "2025-12-23T23:34:14.495Z",
  "sourceLastUpdated": "2025-12-23T23:34:14.495Z",
  "contentFormat": "markdown",
  "contentHash": "240fe5385d51180cc13c2fbe736d2c8fff6e8a841ee6b3e2895fe2ed096c0baa",
  "entity": {
    "repoId": "ethereum-optimism/superchain-ops",
    "owner": "ethereum-optimism",
    "repo": "superchain-ops"
  },
  "content": "# ethereum-optimism/superchain-ops Daily Update (Dec 22, 2025)\n## OVERVIEW \nToday's development focused on enhancing the robustness of multisig tasks by adding gas limit checks and preparing for Upgrade 18 with new templates and regression tests. An important issue regarding op-node's light client following external sources was closed.\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Multisig Task Gas Limit Enforcement\nA new feature was added to revert multisig tasks if the required gas limit approaches the Fusaka transaction gas cap. This improves the reliability and safety of multisig operations by preventing out-of-gas errors. ([#1277](https://github.com/ethereum-optimism/superchain-ops/pull/1277))\n\n### Upgrade 18 Preparation\nWork was completed to integrate the template, example task, and regression tests for Upgrade 18. This includes new Solidity files for `OPCMUpgradeSuperchainConfigV600` and `OPCMUpgradeV600`, along with associated configuration files and environment settings. ([#1313](https://github.com/ethereum-optimism/superchain-ops/pull/1313))\n\n## NEWLY OPENED PULL REQUESTS\nNo new pull requests were opened today.\n\n## CLOSED ISSUES\n\n### op-node Light Client External Source Following\nThe issue concerning the op-node's light client following external sources was closed, with the op-node implementation for this feature now complete. ([#18317](https://github.com/ethereum-optimism/superchain-ops/issues/18317))\n\n## NEW ISSUES\nNo new issues were reported today.\n\n## ACTIVE ISSUES\n\n### op-challenger: Review correct trace output when next super root is not found ([#18643](https://github.com/ethereum-optimism/superchain-ops/issues/18643))\nDiscussion continues on ensuring `op-challenger` correctly handles scenarios where the next super root is not found. The latest comment confirms that the super node trace provider now works correctly, and while `op-supervisor` is being deprecated, the issue remains open until an integration test verifies `op-challenger` and `op-program` alignment. Earlier comments highlighted that this is a real problem, with `op-program` transitioning to an invalid hash when data is insufficient, and questioned the correctness of a specific test case. There was also a note on the `superRootAtTimestamp` RPC returning a \"not found\" error if any chain isn't supported by L1."
}