{
  "version": "1.0",
  "type": "repository",
  "interval": "week",
  "date": "2025-12-14",
  "generatedAt": "2025-12-20T23:33:54.699Z",
  "sourceLastUpdated": "2025-12-20T23:33:54.699Z",
  "contentFormat": "markdown",
  "contentHash": "3addf9441d405adebc209bff33b601df30811ad70a8dd6278c5ca3cf80b29c0f",
  "entity": {
    "repoId": "ethereum-optimism/specs",
    "owner": "ethereum-optimism",
    "repo": "specs"
  },
  "content": "# ethereum-optimism/specs Weekly Report (Dec 14 - 20, 2025)\n\n## 🚀 Highlights\nThis week's activity centered on foundational maintenance and deep architectural discussions for future protocol enhancements. Key progress was made in updating the Cannon fault proof VM specification to reflect new syscalls and resolving a critical CI linting issue that was impeding development workflows. Meanwhile, significant debate continued around the Interop specification, with a growing consensus to simplify the protocol by removing injected replacement transactions. These discussions, alongside planning for Supernode proof testing, highlight a strong focus on refining the security, simplicity, and testability of the OP Stack's next-generation components.\n\n## 🛠️ Key Developments\nWork this week focused on ensuring the accuracy of specifications and the stability of the development environment.\n\n- **Cannon VM Specification Updates:** The Cannon fault proof VM specification was updated to include the `getrandom` and `eventfd2` syscalls, and `mprotect` was added to the VM's scope. This ensures the specification accurately reflects the latest functionalities available within the VM ([#869](https://github.com/ethereum-optimism/specs/pull/869)).\n\n- **CI/CD Maintenance:** A critical fix was merged for the `lint-specs-md-check` CI job, which was failing due to an unexpected version mismatch of `markdownlint-cli2` between local and CI environments. This resolution unblocks pull requests and restores stability to the continuous integration pipeline ([#870](https://github.com/ethereum-optimism/specs/pull/870)).\n\n## 🐛 Issues & Triage\nDiscussions this week tackled protocol design choices for Interop, testing strategies for Supernodes, and active support for node operators.\n\n- **Closed Issues:**\n    - **Documentation & Testing:** A documentation issue regarding the `cannonKonaPrestate` requirement for upgrades was closed, indicating the necessary information has been added ([#18095](https://github.com/ethereum-optimism/specs/issues/18095)). Additionally, the issue to re-enable the previously disabled Kona interop action tests was resolved, although they are not yet a blocking check in CI ([#18613](https://github.com/ethereum-optimism/specs/issues/18613)).\n\n- **New & Active Issues:**\n    - **Interop Protocol Simplification:** The most significant ongoing discussion revolves around simplifying the Interop specification by removing the need for an additional injected replacement transaction ([#18574](https://github.com/ethereum-optimism/specs/issues/18574)). While the transaction was initially considered important for the fault dispute game, the consensus is shifting towards having the Supernode generate the necessary proof data on-demand, simplifying the core protocol.\n    - **Supernode Test Strategy:** A spike is underway to define how to adapt proof action testing for the Supernode architecture ([#18621](https://github.com/ethereum-optimism/specs/issues/18621)). The conversation emphasizes the need for tests to run against a \"real\" Supernode to properly validate challenger interactions.\n    - **Node Synchronization Support:** An active support thread continues for a user experiencing \"missing trie node\" errors ([#18581](https://github.com/ethereum-optimism/specs/issues/18581)). The issue is being diagnosed as a potential state corruption problem, with troubleshooting steps being provided.\n    - **Challenger Correctness:** A new issue was raised to review the trace output of `op-challenger` in a specific failure case, questioning whether the current test assertions are correct when a super root is not found ([#18643](https://github.com/ethereum-optimism/specs/issues/18643)).\n\n## 💬 Community & Collaboration\nThis week saw deep collaboration among core contributors on forward-looking architectural decisions. The active discussions in issues like `#18574` (Interop) and `#18621` (Supernode testing) show key team members like @ajsutton, @Inphi, and @axelKingsley working through complex design trade-offs in the open. Additionally, the community's collaborative nature was evident in issue `#18581`, where team members provided direct support to a user troubleshooting a node synchronization problem."
}