{
  "version": "1.0",
  "type": "repository",
  "interval": "week",
  "date": "2025-12-21",
  "generatedAt": "2025-12-24T23:35:06.684Z",
  "sourceLastUpdated": "2025-12-24T23:35:06.684Z",
  "contentFormat": "markdown",
  "contentHash": "43de3c3fa1bc8669a1a2ab49697524d57edb1f8e3e3154cae2876ae9eb612712",
  "entity": {
    "repoId": "ethereum-optimism/Retro-Funding",
    "owner": "ethereum-optimism",
    "repo": "Retro-Funding"
  },
  "content": "# ethereum-optimism/Retro-Funding Weekly Report (Dec 21 - 27, 2025)\n\n## 🚀 Highlights\nThis week's activity centered on enhancing the robustness of the OP Stack's core components. A key milestone was the closure of an issue enabling `op-node` light clients to follow external data sources, improving their ability to sync with the network. Meanwhile, development continued on the fault-proofing system, with active discussion focused on ensuring the correct behavior of `op-challenger` in specific edge cases. The period was characterized by incremental improvements and maintenance rather than the release of major new features.\n\n## 🛠️ Key Developments\nWork this week focused on routine maintenance and ongoing issue resolution. No major features were merged.\n\n- **Dependency Maintenance:** A pull request was opened to perform a routine version bump for the `marshmallow` dependency from 3.26.1 to 3.26.2 ([#91](https://github.com/ethereum-optimism/Retro-Funding/pull/91)).\n\n## 🐛 Issues & Triage\nIssue management this week saw the resolution of a light client feature and continued refinement of the challenger system. No new issues were opened.\n\n- **Closed Issues:**\n    - **`op-node` Light Client Functionality:** A significant issue was closed, confirming that `op-node` now supports following external safe/finalized data feeds via the `--l2.follow.source` flag ([#18317](https://github.com/ethereum-optimism/Retro-Funding/issues/18317)). This allows a node to mirror an external feed to reach the safe/finalized tip, a key feature for light client operation.\n\n- **New & Active Issues:**\n    - **`op-challenger` Trace Output:** Discussion continued on an active issue concerning the `op-challenger`'s trace output when a subsequent super root is not found ([#18643](https://github.com/ethereum-optimism/Retro-Funding/issues/18643)). While progress was noted in the `super node trace provider`, the issue remains open, pending the creation of an integration test to ensure alignment between `op-challenger` and `op-program`. This discussion is critical for the stability of the fault-proofing system, especially as `op-supervisor` is being deprecated.\n\n## 💬 Community & Collaboration\nDevelopment activity was focused, with technical discussions centered on resolving complex behaviors within the fault-proofing components. The ongoing conversation in issue [#18643](https://github.com/ethereum-optimism/Retro-Funding/issues/18643) highlights the collaborative effort to ensure the correctness and reliability of the challenger and program interactions."
}