{
  "version": "1.0",
  "type": "repository",
  "interval": "week",
  "date": "2025-12-14",
  "generatedAt": "2025-12-20T23:33:48.568Z",
  "sourceLastUpdated": "2025-12-20T23:33:48.568Z",
  "contentFormat": "markdown",
  "contentHash": "eb7219f6e7f7d4e3b44013349626fd4676473eb9d1b612d620d5f1cc72e45769",
  "entity": {
    "repoId": "ethereum-optimism/design-docs",
    "owner": "ethereum-optimism",
    "repo": "design-docs"
  },
  "content": "# ethereum-optimism/design-docs Weekly Report (Dec 14 - 20, 2025)\n\n## 🚀 Highlights\nThis week's efforts centered on protocol refinement and resolving outstanding issues. A key proposal was introduced to simplify the Kona node actor design, aiming to reduce complexity and enhance testability. Progress was also made in closing long-standing issues, including one related to blob priority fee tracking now that the blob tip oracle is in production, and another concerning a potential bug in the sequencer recovery mode. A new bug was identified related to artifact extraction paths in the `op-deployer`.\n\n## 🛠️ Key Developments\nThe primary development activity focused on improving the existing codebase for maintainability and robustness.\n\n- **Protocol Simplification:** A proposal was put forward to simplify the Kona node actor design ([#358](https://github.com/ethereum-optimism/design-docs/pull/358)). The goal of this refactoring effort is to decrease complexity and improve testability by consolidating and removing unnecessary code without altering the actor's core functionality.\n\n## 🐛 Issues & Triage\nIssue management this week saw the closure of two notable items and the report of a new bug.\n\n- **Closed Issues:**\n    - **Blob Priority Fee Tracking ([#18102](https://github.com/ethereum-optimism/design-docs/issues/18102)):** This issue was closed following the confirmation that the blob tip oracle is now deployed to production. The oracle's data suggests the system is currently overpaying for blob transactions, indicating that work is needed to integrate the oracle's fee suggestions.\n    - **Sequencer Recovery Mode Bug ([#18350](https://github.com/ethereum-optimism/design-docs/issues/18350)):** This issue, which described a potential drift problem, was closed after the behavior could not be reproduced. However, related refactoring of the L1 origin code in `op-node` was implemented as a preventative measure.\n\n- **New & Active Issues:**\n    - **Artifact Extraction Path Discrepancy ([#18663](https://github.com/ethereum-optimism/design-docs/issues/18663)):** A new bug was reported in `op-deployer`. The `ExtractFromFile()` function incorrectly expects an `out/` directory instead of `forge-artifacts/`, which breaks the use of self-hosted `.tzst` artifacts.\n\n## 💬 Community & Collaboration\nDiscussions around active issues demonstrated healthy collaboration. The resolution of the sequencer recovery mode bug ([#18350](https://github.com/ethereum-optimism/design-docs/issues/18350)) involved input from multiple contributors, including \"geoknee\" and \"sebastianst,\" who investigated the issue and discussed potential fixes. Similarly, the discussion on blob priority fees ([#18102](https://github.com/ethereum-optimism/design-docs/issues/18102)) included updates from the community on the status of production deployments."
}